In [2]:
import pandas as pd
raw_df = pd.read_excel("../data/government_dataset.xlsx", skiprows=2)

In [3]:
# Print top 5
raw_df.head(5)

,Major Class,Month of Travel Date,From,To,Sum of Net Tickets,Sum of Total $
0,Business Class,Jan,Calgary,Ottawa,2,6045.62
1,Business Class,Jan,Calgary,Victoria,1,740.60
2,Business Class,Jan,Calgary,Winnipeg,0,95.55
3,Business Class,Jan,Campbell River,Ottawa,1,3482.85
4,Business Class,Jan,Charlottetown,Calgary,1,2807.24

In [4]:
raw_df.columns

Index(['Major Class', 'Month of Travel Date', 'From', 'To',
       'Sum of Net Tickets', 'Sum of Total $'],
      dtype='object')

In [14]:
# Function to drop rows with 0 number of tickets and 0 ticket cost
clean_dataframe = lambda raw_df, col_names_to_clean: raw_df[(raw_df[col_names_to_clean["num_of_tickets"]]>0)&(raw_df[col_names_to_clean["total_cost"]]>0)].reset_index().drop("index", axis=1)
# Function to strip spaces
strip_spaces = lambda x: x.strip()

In [15]:
# Generic object to clean the given columns
col_names_to_clean = {
    "num_of_tickets": "Sum of Net Tickets",
    "total_cost": "Sum of Total $"
}
# Column names to be stripped of spaces
col_names_to_strip = ['Major Class', 'Month of Travel Date', 'From', 'To']

In [16]:
# Produce the clean df from raw df
clean_df = clean_dataframe(raw_df, col_names_to_clean)
# Drop the last row
clean_df = clean_df.loc[:clean_df.shape[0]-2, :]
# Strip the columns in df
for each_col in col_names_to_strip:
    clean_df[each_col] = clean_df[each_col].apply(strip_spaces)

In [20]:
clean_df.to_csv("../data/cleaned_government_data.csv", index=False)

In [21]:
clean_df.head(5)

,Major Class,Month of Travel Date,From,To,Sum of Net Tickets,Sum of Total $
0,Business Class,Jan,Calgary,Ottawa,2,6045.62
1,Business Class,Jan,Calgary,Victoria,1,740.60
2,Business Class,Jan,Campbell River,Ottawa,1,3482.85
3,Business Class,Jan,Charlottetown,Calgary,1,2807.24
4,Business Class,Jan,Charlottetown,Ottawa,1,737.35